Case IV/S4/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE;
	value		$internalField;
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant $turbulentKE;
    }

    up
    {
	type		slip;
    }

    down
    {
	type		kqRWallFunction;
	value		uniform 0.0;
    }

    terrain
    {
	type		kqRWallFunction;
	value		uniform 0.0;
    }

    "proc.*"
    {
        type            processor;
    }

}


// ************************************************************************* //
